Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fmc.h
// BWTR4 Configuration

#define FMC_BWTR4_DATAHLD           (0x3u<<30)
#define FMC_BWTR4_DATAHLD_0         (0x1u<<30)
#define FMC_BWTR4_ACCMOD            (0x3u<<28)
#define FMC_BWTR4_ACCMOD_0          (0x1u<<28)
#define FMC_BWTR4_BUSTURN           (0xFu<<16)
#define FMC_BWTR4_BUSTURN_0         (0x1u<<16)
#define FMC_BWTR4_DATAST            (0xFFu<<8)
#define FMC_BWTR4_DATAST_0          (0x1u<<8)
#define FMC_BWTR4_ADDHLD            (0xFu<<4)
#define FMC_BWTR4_ADDHLD_0          (0x1u<<4)
#define FMC_BWTR4_ADDSET            (0xFu<<0)
#define FMC_BWTR4_ADDSET_0          (0x1u<<0)

#define FMC_BWTR4_DATAHLD_B_0X0     (0x0u<<30)
#define FMC_BWTR4_DATAHLD_B_0X1     (0x1u<<30)
#define FMC_BWTR4_DATAHLD_B_0X2     (0x2u<<30)
#define FMC_BWTR4_DATAHLD_B_0X3     (0x3u<<30)
#define FMC_BWTR4_ACCMOD_B_0X0      (0x0u<<28)
#define FMC_BWTR4_ACCMOD_B_0X1      (0x1u<<28)
#define FMC_BWTR4_ACCMOD_B_0X2      (0x2u<<28)
#define FMC_BWTR4_ACCMOD_B_0X3      (0x3u<<28)
#define FMC_BWTR4_BUSTURN_B_0X0     (0x0u<<16)
#define FMC_BWTR4_BUSTURN_B_0XF     (0xFu<<16)
#define FMC_BWTR4_DATAST_B_0X0      (0x0u<<8)
#define FMC_BWTR4_DATAST_B_0X1      (0x1u<<8)
#define FMC_BWTR4_DATAST_B_0X2      (0x2u<<8)
#define FMC_BWTR4_DATAST_B_0XFF     (0xFFu<<8)
#define FMC_BWTR4_ADDHLD_B_0X0      (0x0u<<4)
#define FMC_BWTR4_ADDHLD_B_0X1      (0x1u<<4)
#define FMC_BWTR4_ADDHLD_B_0X2      (0x2u<<4)
#define FMC_BWTR4_ADDHLD_B_0XF      (0xFu<<4)
#define FMC_BWTR4_ADDSET_B_0X0      (0x0u<<0)
#define FMC_BWTR4_ADDSET_B_0XF      (0xFu<<0)

// SDCR1 Configuration

#define FMC_SDCR1_SDINIT            (0x1u<<17)
#define FMC_SDCR1_SDEN              (0x1u<<16)
#define FMC_SDCR1_RPIPE             (0x3u<<13)
#define FMC_SDCR1_RPIPE_0           (0x1u<<13)
#define FMC_SDCR1_SDCLK             (0x3u<<10)
#define FMC_SDCR1_SDCLK_0           (0x1u<<10)
#define FMC_SDCR1_WP                (0x1u<<9)
#define FMC_SDCR1_CAS               (0x3u<<7)
#define FMC_SDCR1_CAS_0             (0x1u<<7)
#define FMC_SDCR1_NB                (0x1u<<6)
#define FMC_SDCR1_MWID              (0x3u<<4)
#define FMC_SDCR1_MWID_0            (0x1u<<4)
#define FMC_SDCR1_NR                (0x3u<<2)
#define FMC_SDCR1_NR_0              (0x1u<<2)
#define FMC_SDCR1_NC                (0x3u<<0)
#define FMC_SDCR1_NC_0              (0x1u<<0)

#define FMC_SDCR1_SDINIT_B_0X1      (0x1u<<17)
#define FMC_SDCR1_SDINIT_B_0X0      (0x0u<<17)
#define FMC_SDCR1_SDEN_B_0X1        (0x1u<<16)
#define FMC_SDCR1_SDEN_B_0X0        (0x0u<<16)
#define FMC_SDCR1_RPIPE_B_0X0       (0x0u<<13)
#define FMC_SDCR1_RPIPE_B_0X1       (0x1u<<13)
#define FMC_SDCR1_RPIPE_B_0X2       (0x2u<<13)
#define FMC_SDCR1_RPIPE_B_0X3       (0x3u<<13)
#define FMC_SDCR1_SDCLK_B_0X0       (0x0u<<10)
#define FMC_SDCR1_SDCLK_B_0X1       (0x1u<<10)
#define FMC_SDCR1_SDCLK_B_0X2       (0x2u<<10)
#define FMC_SDCR1_SDCLK_B_0X3       (0x3u<<10)
#define FMC_SDCR1_WP_B_0X0          (0x0u<<9)
#define FMC_SDCR1_WP_B_0X1          (0x1u<<9)
#define FMC_SDCR1_CAS_B_0X0         (0x0u<<7)
#define FMC_SDCR1_CAS_B_0X1         (0x1u<<7)
#define FMC_SDCR1_CAS_B_0X2         (0x2u<<7)
#define FMC_SDCR1_CAS_B_0X3         (0x3u<<7)
#define FMC_SDCR1_NB_B_0X0          (0x0u<<6)
#define FMC_SDCR1_NB_B_0X1          (0x1u<<6)
#define FMC_SDCR1_MWID_B_0X0        (0x0u<<4)
#define FMC_SDCR1_MWID_B_0X1        (0x1u<<4)
#define FMC_SDCR1_MWID_B_0X2        (0x2u<<4)
#define FMC_SDCR1_MWID_B_0X3        (0x3u<<4)
#define FMC_SDCR1_NR_B_0X0          (0x0u<<2)
#define FMC_SDCR1_NR_B_0X1          (0x1u<<2)
#define FMC_SDCR1_NR_B_0X2          (0x2u<<2)
#define FMC_SDCR1_NR_B_0X3          (0x3u<<2)
#define FMC_SDCR1_NC_B_0X0          (0x0u<<0)
#define FMC_SDCR1_NC_B_0X1          (0x1u<<0)
#define FMC_SDCR1_NC_B_0X2          (0x2u<<0)
#define FMC_SDCR1_NC_B_0X3          (0x3u<<0)

// SDCR2 Configuration

#define FMC_SDCR2_SDINIT            (0x1u<<17)
#define FMC_SDCR2_SDEN              (0x1u<<16)
#define FMC_SDCR2_WP                (0x1u<<9)
#define FMC_SDCR2_CAS               (0x3u<<7)
#define FMC_SDCR2_CAS_0             (0x1u<<7)
#define FMC_SDCR2_NB                (0x1u<<6)
#define FMC_SDCR2_MWID              (0x3u<<4)
#define FMC_SDCR2_MWID_0            (0x1u<<4)
#define FMC_SDCR2_NR                (0x3u<<2)
#define FMC_SDCR2_NR_0              (0x1u<<2)
#define FMC_SDCR2_NC                (0x3u<<0)
#define FMC_SDCR2_NC_0              (0x1u<<0)

#define FMC_SDCR2_SDINIT_B_0X1      (0x1u<<17)
#define FMC_SDCR2_SDINIT_B_0X0      (0x0u<<17)
#define FMC_SDCR2_SDEN_B_0X1        (0x1u<<16)
#define FMC_SDCR2_SDEN_B_0X0        (0x0u<<16)
#define FMC_SDCR2_WP_B_0X0          (0x0u<<9)
#define FMC_SDCR2_WP_B_0X1          (0x1u<<9)
#define FMC_SDCR2_CAS_B_0X0         (0x0u<<7)
#define FMC_SDCR2_CAS_B_0X1         (0x1u<<7)
#define FMC_SDCR2_CAS_B_0X2         (0x2u<<7)
#define FMC_SDCR2_CAS_B_0X3         (0x3u<<7)
#define FMC_SDCR2_NB_B_0X0          (0x0u<<6)
#define FMC_SDCR2_NB_B_0X1          (0x1u<<6)
#define FMC_SDCR2_MWID_B_0X0        (0x0u<<4)
#define FMC_SDCR2_MWID_B_0X1        (0x1u<<4)
#define FMC_SDCR2_MWID_B_0X2        (0x2u<<4)
#define FMC_SDCR2_MWID_B_0X3        (0x3u<<4)
#define FMC_SDCR2_NR_B_0X0          (0x0u<<2)
#define FMC_SDCR2_NR_B_0X1          (0x1u<<2)
#define FMC_SDCR2_NR_B_0X2          (0x2u<<2)
#define FMC_SDCR2_NR_B_0X3          (0x3u<<2)
#define FMC_SDCR2_NC_B_0X0          (0x0u<<0)
#define FMC_SDCR2_NC_B_0X1          (0x1u<<0)
#define FMC_SDCR2_NC_B_0X2          (0x2u<<0)
#define FMC_SDCR2_NC_B_0X3          (0x3u<<0)

// SDTR Configuration

#define FMC_SDTR_TRCD               (0xFu<<24)
#define FMC_SDTR_TRCD_0             (0x1u<<24)
#define FMC_SDTR_TRP                (0xFu<<20)
#define FMC_SDTR_TRP_0              (0x1u<<20)
#define FMC_SDTR_TWR                (0xFu<<16)
#define FMC_SDTR_TWR_0              (0x1u<<16)
#define FMC_SDTR_TRC                (0xFu<<12)
#define FMC_SDTR_TRC_0              (0x1u<<12)
#define FMC_SDTR_TRAS               (0xFu<<8)
#define FMC_SDTR_TRAS_0             (0x1u<<8)
#define FMC_SDTR_TXSR               (0xFu<<4)
#define FMC_SDTR_TXSR_0             (0x1u<<4)
#define FMC_SDTR_TMRD               (0xFu<<0)
#define FMC_SDTR_TMRD_0             (0x1u<<0)

