Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fmc.h
#define FMC_SDTR_TRCD_B_0X0         (0x0u<<24)
#define FMC_SDTR_TRCD_B_0X1         (0x1u<<24)
#define FMC_SDTR_TRCD_B_0XF         (0xFu<<24)
#define FMC_SDTR_TRP_B_0X0          (0x0u<<20)
#define FMC_SDTR_TRP_B_0X1          (0x1u<<20)
#define FMC_SDTR_TRP_B_0XF          (0xFu<<20)
#define FMC_SDTR_TWR_B_0X0          (0x0u<<16)
#define FMC_SDTR_TWR_B_0X1          (0x1u<<16)
#define FMC_SDTR_TWR_B_0XF          (0xFu<<16)
#define FMC_SDTR_TRC_B_0X0          (0x0u<<12)
#define FMC_SDTR_TRC_B_0X1          (0x1u<<12)
#define FMC_SDTR_TRC_B_0XF          (0xFu<<12)
#define FMC_SDTR_TRAS_B_0X0         (0x0u<<8)
#define FMC_SDTR_TRAS_B_0X1         (0x1u<<8)
#define FMC_SDTR_TRAS_B_0XF         (0xFu<<8)
#define FMC_SDTR_TXSR_B_0X0         (0x0u<<4)
#define FMC_SDTR_TXSR_B_0X1         (0x1u<<4)
#define FMC_SDTR_TXSR_B_0XF         (0xFu<<4)
#define FMC_SDTR_TMRD_B_0X0         (0x0u<<0)
#define FMC_SDTR_TMRD_B_0X1         (0x1u<<0)
#define FMC_SDTR_TMRD_B_0XF         (0xFu<<0)

// SDCMR Configuration

#define FMC_SDCMR_MRD               (0x3FFFu<<9)
#define FMC_SDCMR_MRD_0             (0x1u<<9)
#define FMC_SDCMR_NRFS              (0xFu<<5)
#define FMC_SDCMR_NRFS_0            (0x1u<<5)
#define FMC_SDCMR_DS1               (0x1u<<4)
#define FMC_SDCMR_DS2               (0x1u<<3)
#define FMC_SDCMR_MODE              (0x7u<<0)
#define FMC_SDCMR_MODE_0            (0x1u<<0)

#define FMC_SDCMR_NRFS_B_0X0        (0x0u<<5)
#define FMC_SDCMR_NRFS_B_0X1        (0x1u<<5)
#define FMC_SDCMR_NRFS_B_0XE        (0xEu<<5)
#define FMC_SDCMR_NRFS_B_0XF        (0xFu<<5)
#define FMC_SDCMR_DS1_B_0X0         (0x0u<<4)
#define FMC_SDCMR_DS1_B_0X1         (0x1u<<4)
#define FMC_SDCMR_DS2_B_0X0         (0x0u<<3)
#define FMC_SDCMR_DS2_B_0X1         (0x1u<<3)
#define FMC_SDCMR_MODE_B_0X0        (0x0u<<0)
#define FMC_SDCMR_MODE_B_0X2        (0x2u<<0)
#define FMC_SDCMR_MODE_B_0X3        (0x3u<<0)
#define FMC_SDCMR_MODE_B_0X4        (0x4u<<0)
#define FMC_SDCMR_MODE_B_0X5        (0x5u<<0)
#define FMC_SDCMR_MODE_B_0X6        (0x6u<<0)

// SDRTR Configuration

#define FMC_SDRTR_REIE              (0x1u<<14)
#define FMC_SDRTR_RFSCNT            (0x1FFFu<<1)
#define FMC_SDRTR_RFSCNT_0          (0x1u<<1)
#define FMC_SDRTR_CRE               (0x1u<<0)

#define FMC_SDRTR_REIE_B_0X0        (0x0u<<14)
#define FMC_SDRTR_REIE_B_0X1        (0x1u<<14)
#define FMC_SDRTR_CRE_B_0X0         (0x0u<<0)
#define FMC_SDRTR_CRE_B_0X1         (0x1u<<0)

// SDSR Configuration

#define FMC_SDSR_CMDOK              (0x1u<<15)
#define FMC_SDSR_MODES2             (0x3u<<3)
#define FMC_SDSR_MODES2_0           (0x1u<<3)
#define FMC_SDSR_MODES1             (0x3u<<1)
#define FMC_SDSR_MODES1_0           (0x1u<<1)
#define FMC_SDSR_RE                 (0x1u<<0)

#define FMC_SDSR_CMDOK_B_0X0        (0x0u<<15)
#define FMC_SDSR_CMDOK_B_0X1        (0x1u<<15)
#define FMC_SDSR_MODES2_B_0X0       (0x0u<<3)
#define FMC_SDSR_MODES2_B_0X1       (0x1u<<3)
#define FMC_SDSR_MODES2_B_0X2       (0x2u<<3)
#define FMC_SDSR_MODES1_B_0X0       (0x0u<<1)
#define FMC_SDSR_MODES1_B_0X1       (0x1u<<1)
#define FMC_SDSR_MODES1_B_0X2       (0x2u<<1)
#define FMC_SDSR_RE_B_0X0           (0x0u<<0)
#define FMC_SDSR_RE_B_0X1           (0x1u<<0)

// IER Configuration

#define FMC_IER_IFEE                (0x1u<<2)
#define FMC_IER_IHLE                (0x1u<<1)
#define FMC_IER_IREE                (0x1u<<0)

#define FMC_IER_IFEE_B_0X0          (0x0u<<2)
#define FMC_IER_IFEE_B_0X1          (0x1u<<2)
#define FMC_IER_IHLE_B_0X0          (0x0u<<1)
#define FMC_IER_IHLE_B_0X1          (0x1u<<1)
#define FMC_IER_IREE_B_0X0          (0x0u<<0)
#define FMC_IER_IREE_B_0X1          (0x1u<<0)

// ISR Configuration

#define FMC_ISR_IFEF                (0x1u<<2)
#define FMC_ISR_IHLF                (0x1u<<1)
#define FMC_ISR_IREF                (0x1u<<0)

#define FMC_ISR_IFEF_B_0X0          (0x0u<<2)
#define FMC_ISR_IFEF_B_0X1          (0x1u<<2)
#define FMC_ISR_IHLF_B_0X0          (0x0u<<1)
#define FMC_ISR_IHLF_B_0X1          (0x1u<<1)
#define FMC_ISR_IREF_B_0X0          (0x0u<<0)
#define FMC_ISR_IREF_B_0X1          (0x1u<<0)

// ICR Configuration

#define FMC_ICR_CIFEF               (0x1u<<2)
#define FMC_ICR_CIHLF               (0x1u<<1)
#define FMC_ICR_CIREF               (0x1u<<0)

#define FMC_ICR_CIFEF_B_0X0         (0x0u<<2)
#define FMC_ICR_CIFEF_B_0X1         (0x1u<<2)
#define FMC_ICR_CIHLF_B_0X0         (0x0u<<1)
#define FMC_ICR_CIHLF_B_0X1         (0x1u<<1)
#define FMC_ICR_CIREF_B_0X0         (0x0u<<0)
#define FMC_ICR_CIREF_B_0X1         (0x1u<<0)

// CSQCR Configuration

#define FMC_CSQCR_CSQSTART          (0x1u<<0)

// CSQCFGR1 Configuration

#define FMC_CSQCFGR1_CMD2T          (0x1u<<25)
#define FMC_CSQCFGR1_CMD1T          (0x1u<<24)
#define FMC_CSQCFGR1_CMD2           (0xFFu<<16)
#define FMC_CSQCFGR1_CMD2_0         (0x1u<<16)
#define FMC_CSQCFGR1_CMD1           (0xFFu<<8)
#define FMC_CSQCFGR1_CMD1_0         (0x1u<<8)
#define FMC_CSQCFGR1_ACYNBR         (0x7u<<4)
#define FMC_CSQCFGR1_ACYNBR_0       (0x1u<<4)
#define FMC_CSQCFGR1_DMADEN         (0x1u<<2)
#define FMC_CSQCFGR1_CMD2EN         (0x1u<<1)

#define FMC_CSQCFGR1_CMD2T_B_0X0    (0x0u<<25)
#define FMC_CSQCFGR1_CMD2T_B_0X1    (0x1u<<25)
#define FMC_CSQCFGR1_CMD1T_B_0X0    (0x0u<<24)
#define FMC_CSQCFGR1_CMD1T_B_0X1    (0x1u<<24)
#define FMC_CSQCFGR1_ACYNBR_B_0X0   (0x0u<<4)
#define FMC_CSQCFGR1_ACYNBR_B_0X1   (0x1u<<4)
#define FMC_CSQCFGR1_ACYNBR_B_0X2   (0x2u<<4)
#define FMC_CSQCFGR1_ACYNBR_B_0X3   (0x3u<<4)
#define FMC_CSQCFGR1_ACYNBR_B_0X4   (0x4u<<4)
#define FMC_CSQCFGR1_ACYNBR_B_0X5   (0x5u<<4)
#define FMC_CSQCFGR1_DMADEN_B_0X0   (0x0u<<2)
#define FMC_CSQCFGR1_DMADEN_B_0X1   (0x1u<<2)
#define FMC_CSQCFGR1_CMD2EN_B_0X0   (0x0u<<1)
#define FMC_CSQCFGR1_CMD2EN_B_0X1   (0x1u<<1)

// CSQCFGR2 Configuration

#define FMC_CSQCFGR2_RCMD2T         (0x1u<<25)
#define FMC_CSQCFGR2_RCMD1T         (0x1u<<24)
#define FMC_CSQCFGR2_RCMD2          (0xFFu<<16)
#define FMC_CSQCFGR2_RCMD2_0        (0x1u<<16)
#define FMC_CSQCFGR2_RCMD1          (0xFFu<<8)
#define FMC_CSQCFGR2_RCMD1_0        (0x1u<<8)
#define FMC_CSQCFGR2_DMASEN         (0x1u<<2)
#define FMC_CSQCFGR2_RCMD2EN        (0x1u<<1)
#define FMC_CSQCFGR2_SQSDTEN        (0x1u<<0)

#define FMC_CSQCFGR2_RCMD2T_B_0X0   (0x0u<<25)
#define FMC_CSQCFGR2_RCMD2T_B_0X1   (0x1u<<25)
#define FMC_CSQCFGR2_RCMD1T_B_0X0   (0x0u<<24)
#define FMC_CSQCFGR2_RCMD1T_B_0X1   (0x1u<<24)
#define FMC_CSQCFGR2_DMASEN_B_0X0   (0x0u<<2)
#define FMC_CSQCFGR2_DMASEN_B_0X1   (0x1u<<2)
#define FMC_CSQCFGR2_RCMD2EN_B_0X0  (0x0u<<1)
#define FMC_CSQCFGR2_RCMD2EN_B_0X1  (0x1u<<1)
#define FMC_CSQCFGR2_SQSDTEN_B_0X0  (0x0u<<0)
#define FMC_CSQCFGR2_SQSDTEN_B_0X1  (0x1u<<0)

// CSQCFGR3 Configuration

#define FMC_CSQCFGR3_RAC2T          (0x1u<<23)
#define FMC_CSQCFGR3_RAC1T          (0x1u<<22)
#define FMC_CSQCFGR3_SDT            (0x1u<<21)
#define FMC_CSQCFGR3_AC5T           (0x1u<<20)
#define FMC_CSQCFGR3_AC4T           (0x1u<<19)
#define FMC_CSQCFGR3_AC3T           (0x1u<<18)
#define FMC_CSQCFGR3_AC2T           (0x1u<<17)
#define FMC_CSQCFGR3_AC1T           (0x1u<<16)
#define FMC_CSQCFGR3_SNBR           (0x3Fu<<8)
#define FMC_CSQCFGR3_SNBR_0         (0x1u<<8)

#define FMC_CSQCFGR3_RAC2T_B_0X0    (0x0u<<23)
#define FMC_CSQCFGR3_RAC2T_B_0X1    (0x1u<<23)
#define FMC_CSQCFGR3_RAC1T_B_0X0    (0x0u<<22)
#define FMC_CSQCFGR3_RAC1T_B_0X1    (0x1u<<22)
#define FMC_CSQCFGR3_SDT_B_0X0      (0x0u<<21)
#define FMC_CSQCFGR3_SDT_B_0X1      (0x1u<<21)
#define FMC_CSQCFGR3_AC5T_B_0X0     (0x0u<<20)
#define FMC_CSQCFGR3_AC5T_B_0X1     (0x1u<<20)
#define FMC_CSQCFGR3_AC4T_B_0X0     (0x0u<<19)
#define FMC_CSQCFGR3_AC4T_B_0X1     (0x1u<<19)
#define FMC_CSQCFGR3_AC3T_B_0X0     (0x0u<<18)
#define FMC_CSQCFGR3_AC3T_B_0X1     (0x1u<<18)
#define FMC_CSQCFGR3_AC2T_B_0X0     (0x0u<<17)
#define FMC_CSQCFGR3_AC2T_B_0X1     (0x1u<<17)
#define FMC_CSQCFGR3_AC1T_B_0X0     (0x0u<<16)
#define FMC_CSQCFGR3_AC1T_B_0X1     (0x1u<<16)
#define FMC_CSQCFGR3_SNBR_B_0X0     (0x0u<<8)
#define FMC_CSQCFGR3_SNBR_B_0X1     (0x1u<<8)
#define FMC_CSQCFGR3_SNBR_B_0X3F    (0x3Fu<<8)

