Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fmc.h
// CSQAR1 Configuration

#define FMC_CSQAR1_ADDC4            (0xFFu<<24)
#define FMC_CSQAR1_ADDC4_0          (0x1u<<24)
#define FMC_CSQAR1_ADDC3            (0xFFu<<16)
#define FMC_CSQAR1_ADDC3_0          (0x1u<<16)
#define FMC_CSQAR1_ADDC2            (0xFFu<<8)
#define FMC_CSQAR1_ADDC2_0          (0x1u<<8)
#define FMC_CSQAR1_ADDC1            (0xFFu<<0)
#define FMC_CSQAR1_ADDC1_0          (0x1u<<0)

// CSQAR2 Configuration

#define FMC_CSQAR2_SAO              (0xFFFFu<<16)
#define FMC_CSQAR2_SAO_0            (0x1u<<16)
#define FMC_CSQAR2_ADDC5            (0xFFu<<0)
#define FMC_CSQAR2_ADDC5_0          (0x1u<<0)

// CSQIER Configuration

#define FMC_CSQIER_CMDTCIE          (0x1u<<4)
#define FMC_CSQIER_SUEIE            (0x1u<<3)
#define FMC_CSQIER_SEIE             (0x1u<<2)
#define FMC_CSQIER_SCIE             (0x1u<<1)
#define FMC_CSQIER_TCIE             (0x1u<<0)

#define FMC_CSQIER_CMDTCIE_B_0X0    (0x0u<<4)
#define FMC_CSQIER_CMDTCIE_B_0X1    (0x1u<<4)
#define FMC_CSQIER_SUEIE_B_0X0      (0x0u<<3)
#define FMC_CSQIER_SUEIE_B_0X1      (0x1u<<3)
#define FMC_CSQIER_SEIE_B_0X0       (0x0u<<2)
#define FMC_CSQIER_SEIE_B_0X1       (0x1u<<2)
#define FMC_CSQIER_SCIE_B_0X0       (0x0u<<1)
#define FMC_CSQIER_SCIE_B_0X1       (0x1u<<1)
#define FMC_CSQIER_TCIE_B_0X0       (0x0u<<0)
#define FMC_CSQIER_TCIE_B_0X1       (0x1u<<0)

// CSQISR Configuration

#define FMC_CSQISR_CMDTCF           (0x1u<<4)
#define FMC_CSQISR_SUEF             (0x1u<<3)
#define FMC_CSQISR_SEF              (0x1u<<2)
#define FMC_CSQISR_SCF              (0x1u<<1)
#define FMC_CSQISR_TCF              (0x1u<<0)

// CSQICR Configuration

#define FMC_CSQICR_CCMDTCF          (0x1u<<4)
#define FMC_CSQICR_CSUEF            (0x1u<<3)
#define FMC_CSQICR_CSEF             (0x1u<<2)
#define FMC_CSQICR_CSCF             (0x1u<<1)
#define FMC_CSQICR_CTCF             (0x1u<<0)

// CSQEMSR Configuration

#define FMC_CSQEMSR_SEM             (0xFFFFu<<0)
#define FMC_CSQEMSR_SEM_0           (0x1u<<0)

// BCHIER Configuration

#define FMC_BCHIER_EPBRIE           (0x1u<<4)
#define FMC_BCHIER_DSRIE            (0x1u<<3)
#define FMC_BCHIER_DEFIE            (0x1u<<2)
#define FMC_BCHIER_DERIE            (0x1u<<1)
#define FMC_BCHIER_DUEIE            (0x1u<<0)

#define FMC_BCHIER_EPBRIE_B_0X0     (0x0u<<4)
#define FMC_BCHIER_EPBRIE_B_0X1     (0x1u<<4)
#define FMC_BCHIER_DSRIE_B_0X0      (0x0u<<3)
#define FMC_BCHIER_DSRIE_B_0X1      (0x1u<<3)
#define FMC_BCHIER_DEFIE_B_0X0      (0x0u<<2)
#define FMC_BCHIER_DEFIE_B_0X1      (0x1u<<2)
#define FMC_BCHIER_DERIE_B_0X0      (0x0u<<1)
#define FMC_BCHIER_DERIE_B_0X1      (0x1u<<1)
#define FMC_BCHIER_DUEIE_B_0X0      (0x0u<<0)
#define FMC_BCHIER_DUEIE_B_0X1      (0x1u<<0)

// BCHISR Configuration

#define FMC_BCHISR_EPBRF            (0x1u<<4)
#define FMC_BCHISR_DSRF             (0x1u<<3)
#define FMC_BCHISR_DEFF             (0x1u<<2)
#define FMC_BCHISR_DERF             (0x1u<<1)
#define FMC_BCHISR_DUEF             (0x1u<<0)

// BCHICR Configuration

#define FMC_BCHICR_CEPBRF           (0x1u<<4)
#define FMC_BCHICR_CDSRF            (0x1u<<3)
#define FMC_BCHICR_CDEFF            (0x1u<<2)
#define FMC_BCHICR_CDERF            (0x1u<<1)
#define FMC_BCHICR_CDUEF            (0x1u<<0)

// BCHPBR1 Configuration

#define FMC_BCHPBR1_BCHPB           (0xFFFFFFFFu<<0)
#define FMC_BCHPBR1_BCHPB_0         (0x1u<<0)

// BCHPBR2 Configuration

#define FMC_BCHPBR2_BCHPB           (0xFFFFFFFFu<<0)
#define FMC_BCHPBR2_BCHPB_0         (0x1u<<0)

// BCHPBR3 Configuration

#define FMC_BCHPBR3_BCHPB           (0xFFFFFFFFu<<0)
#define FMC_BCHPBR3_BCHPB_0         (0x1u<<0)

// BCHPBR4 Configuration

#define FMC_BCHPBR4_BCHPB           (0xFFu<<0)
#define FMC_BCHPBR4_BCHPB_0         (0x1u<<0)

// BCHDSR0 Configuration

#define FMC_BCHDSR0_DEN             (0xFu<<4)
#define FMC_BCHDSR0_DEN_0           (0x1u<<4)
#define FMC_BCHDSR0_DEF             (0x1u<<1)
#define FMC_BCHDSR0_DUE             (0x1u<<0)

// BCHDSR1 Configuration

#define FMC_BCHDSR1_EBP2            (0x1FFFu<<16)
#define FMC_BCHDSR1_EBP2_0          (0x1u<<16)
#define FMC_BCHDSR1_EBP1            (0x1FFFu<<0)
#define FMC_BCHDSR1_EBP1_0          (0x1u<<0)

// BCHDSR2 Configuration

#define FMC_BCHDSR2_EBP4            (0x1FFFu<<16)
#define FMC_BCHDSR2_EBP4_0          (0x1u<<16)
#define FMC_BCHDSR2_EBP3            (0x1FFFu<<0)
#define FMC_BCHDSR2_EBP3_0          (0x1u<<0)

// BCHDSR3 Configuration

#define FMC_BCHDSR3_EBP6            (0x1FFFu<<16)
#define FMC_BCHDSR3_EBP6_0          (0x1u<<16)
#define FMC_BCHDSR3_EBP5            (0x1FFFu<<0)
#define FMC_BCHDSR3_EBP5_0          (0x1u<<0)

// BCHDSR4 Configuration

#define FMC_BCHDSR4_EBP8            (0x1FFFu<<16)
#define FMC_BCHDSR4_EBP8_0          (0x1u<<16)
#define FMC_BCHDSR4_EBP7            (0x1FFFu<<0)
#define FMC_BCHDSR4_EBP7_0          (0x1u<<0)
